In [52]:
import pandas as pd

In [53]:
df1 = pd.read_csv(('Cleaned_Combined_Kaggle_Data.csv'))
# df2 = pd.read_csv(('Combined_Means_Dataset.csv'))
# df3 = pd.read_csv(('Men_Means_Dataset.csv'))
# df4 = pd.read_csv(('Women_Means_Dataset.csv'))

In [54]:
df1.drop(['Country'],axis=1,inplace=True)
df1.head()

    Age Gender     Formal_Education           Position  Years_Coding    Salary
0  23.0   Male      Master’s degree  Software Engineer           2.0   34999.5
1  42.0   Male  Professional degree  Software Engineer           0.0    6249.5
2  42.0   Male      Master’s degree              Other           2.0  274999.5
3  52.0   Male      Master’s degree     Data Scientist          20.0   64999.5
4  23.0   Male      Master’s degree     Data Scientist           5.0   12499.5

In [55]:
from sklearn.preprocessing import OrdinalEncoder 
encoder = OrdinalEncoder()
cats = [['I prefer not to answer',0],
       ['No formal education past high school',1],
       ['Some college/university study without earning a bachelors degree',2],
       ['Professional degree',3],
       ['Bachelors degree',4],
       ['Masters degree',5],
       ['Doctoral degree',6]]

In [56]:
encoded_cats = encoder.fit_transform(df1[['Formal_Education']])

In [57]:
df1['Formal_Education']=encoded_cats
df1

,Age,Gender,Formal_Education,Position,Years_Coding,Salary
0,23.0,Male,3.0,Software Engineer,2.0,34999.5
1,42.0,Male,5.0,Software Engineer,0.0,6249.5
2,42.0,Male,3.0,Other,2.0,274999.5
3,52.0,Male,3.0,Data Scientist,20.0,64999.5
4,23.0,Male,3.0,Data Scientist,5.0,12499.5
...,...,...,...,...,...,...
26166,64.5,Male,6.0,Machine Learning Engineer,20.0,64999.5
26167,23.0,Male,0.0,Data Scientist,2.0,12499.5
26168,27.0,Male,3.0,Research Scientist,10.0,8749.5
26169,37.0,Male,2.0,Machine Learning Engineer,2.0,2499.5
26170,37.0,Male,0.0,Other,20.0,17499.5

In [58]:
df1.drop(['Position'],axis=1,inplace=True)
df1.head()

    Age Gender  Formal_Education  Years_Coding    Salary
0  23.0   Male               3.0           2.0   34999.5
1  42.0   Male               5.0           0.0    6249.5
2  42.0   Male               3.0           2.0  274999.5
3  52.0   Male               3.0          20.0   64999.5
4  23.0   Male               3.0           5.0   12499.5

In [59]:
df1 = df1.reset_index()
# df2 = df2.reset_index()
# df3 = df3.reset_index()
# df4 = df4.reset_index()

In [60]:
df1

       index   Age Gender  Formal_Education  Years_Coding    Salary
0          0  23.0   Male               3.0           2.0   34999.5
1          1  42.0   Male               5.0           0.0    6249.5
2          2  42.0   Male               3.0           2.0  274999.5
3          3  52.0   Male               3.0          20.0   64999.5
4          4  23.0   Male               3.0           5.0   12499.5
...      ...   ...    ...               ...           ...       ...
26166  26166  64.5   Male               6.0          20.0   64999.5
26167  26167  23.0   Male               0.0           2.0   12499.5
26168  26168  27.0   Male               3.0          10.0    8749.5
26169  26169  37.0   Male               2.0           2.0    2499.5
26170  26170  37.0   Male               0.0          20.0   17499.5

[26171 rows x 6 columns]

In [61]:
Women_df = df1[df1['Gender'] == 'Female']
Women_df

       index   Age  Gender  Formal_Education  Years_Coding    Salary
5          5  23.0  Female               0.0           5.0   84999.5
9          9  52.0  Female               3.0          20.0  137499.5
11        11  23.0  Female               3.0           2.0   22499.5
19        19  32.0  Female               3.0          10.0  174999.5
24        24  32.0  Female               1.0          20.0   94999.5
...      ...   ...     ...               ...           ...       ...
26127  26127  37.0  Female               3.0           2.0   84999.5
26135  26135  52.0  Female               3.0          20.0  174999.5
26139  26139  27.0  Female               3.0           2.0   22499.5
26145  26145  23.0  Female               6.0           2.0   27499.5
26164  26164  32.0  Female               0.0           2.0   17499.5

[3513 rows x 6 columns]

In [62]:
Men_df = df1[df1['Gender'] == 'Female']
Men_df

       index   Age  Gender  Formal_Education  Years_Coding    Salary
5          5  23.0  Female               0.0           5.0   84999.5
9          9  52.0  Female               3.0          20.0  137499.5
11        11  23.0  Female               3.0           2.0   22499.5
19        19  32.0  Female               3.0          10.0  174999.5
24        24  32.0  Female               1.0          20.0   94999.5
...      ...   ...     ...               ...           ...       ...
26127  26127  37.0  Female               3.0           2.0   84999.5
26135  26135  52.0  Female               3.0          20.0  174999.5
26139  26139  27.0  Female               3.0           2.0   22499.5
26145  26145  23.0  Female               6.0           2.0   27499.5
26164  26164  32.0  Female               0.0           2.0   17499.5

[3513 rows x 6 columns]

In [66]:
Women_df.to_csv(r'Cleaned_Women_Kaggle_Data_Encoded.csv', index = False)
# df2.to_csv(r'Combined_Means_Dataset1.csv', index = False)
# df3.to_csv(r'Men_Means_Dataset1.csv', index = False)
# df4.to_csv(r'Women_Means_Dataset1.csv', index = False)

In [67]:
import csv
import json
 
 
# Function to convert a CSV to JSON
# Takes the file paths as arguments
def make_json(csvFilePath, jsonFilePath):
     
    # create a dictionary
    data = {}
     
    # Open a csv reader called DictReader
    with open(csvFilePath, encoding='utf-8') as csvf:
        csvReader = csv.DictReader(csvf)
         
        # Convert each row into a dictionary
        # and add it to data
        for rows in csvReader:
             
            # Assuming a column named 'No' to
            # be the primary key
            key = rows['index']
            data[key] = rows
 
    # Open a json writer, and use the json.dumps()
    # function to dump data
    with open(jsonFilePath, 'w', encoding='utf-8') as jsonf:
        jsonf.write(json.dumps(data, indent=4))
         
# Driver Code
 
# Decide the two file paths according to your
# computer system
csvFilePath = r'Cleaned_Women_Kaggle_Data_Encoded.csv'
jsonFilePath = r'Cleaned_Women_Kaggle_Data_Encoded.json'
 
# Call the make_json function
make_json(csvFilePath, jsonFilePath)

In [68]:
df1 = pd.read_json('Cleaned_Women_Kaggle_Data_Encoded.json')
print(df1)

                    5         9        11        19       24       30     \
index                   5         9       11        19       24       30
Age                  23.0      52.0     23.0      32.0     32.0     37.0
Gender             Female    Female   Female    Female   Female   Female
Formal_Education      0.0       3.0      3.0       3.0      1.0      0.0
Years_Coding          5.0      20.0      2.0      10.0     20.0     10.0
Salary            84999.5  137499.5  22499.5  174999.5  94999.5  44999.5

                   36        54        68       81     ...    26075   26084  \
index                 36        54        68       81  ...    26075   26084
Age                 47.0      32.0      32.0     19.5  ...     23.0    27.0
Gender            Female    Female    Female   Female  ...   Female  Female
Formal_Education     1.0       3.0       3.0      0.0  ...      0.0     0.0
Years_Coding         5.0       5.0      20.0      2.0  ...      2.0     5.0
Salary            2499.5  137499.5  112499.5  17499.5  ...  44999.5  4499.5

                    26099    26110    26113    26127     26135    26139  \
index               26099    26110    26113    26127     26135    26139
Age                  23.0     37.0     37.0     37.0      52.0     27.0
Gender             Female   Female   Female   Female    Female   Female
Formal_Education      3.0      3.0      3.0      3.0       3.0      3.0
Years_Coding          5.0      2.0      5.0      2.0      20.0      2.0
Salary            12499.5  44999.5  44999.5  84999.5  174999.5  22499.5

                    26145    26164
index               26145    26164
Age                  23.0     32.0
Gender             Female   Female
Formal_Education      6.0      0.0
Years_Coding          2.0      2.0
Salary            27499.5  17499.5

[6 rows x 3513 columns]

In [12]:
df1.head()

,0,1,2,3,4,5,6,7,8,9,...,26161,26162,26163,26164,26165,26166,26167,26168,26169,26170
index,0,1,2,3,4,5,6,7,8,9,...,26161,26162,26163,26164,26165,26166,26167,26168,26169,26170
Age,23.0,42.0,42.0,52.0,23.0,23.0,32.0,32.0,32.0,52.0,...,27.0,42.0,42.0,32.0,47.0,64.5,23.0,27.0,37.0,37.0
Gender,Male,Male,Male,Male,Male,Female,Male,Male,Male,Female,...,Male,Male,Male,Female,Male,Male,Male,Male,Male,Male
Country,France,India,Australia,France,India,United States of America,Germany,Germany,United States of America,United States of America,...,Other,Other,United Kingdom of Great Britain and Northern I...,Turkey,Nigeria,Italy,Indonesia,Brazil,Malaysia,Thailand
Formal_Education,Master’s degree,Professional degree,Master’s degree,Master’s degree,Master’s degree,Bachelor’s degree,Master’s degree,Bachelor’s degree,Master’s degree,Master’s degree,...,Master’s degree,Professional degree,Doctoral degree,Bachelor’s degree,Master’s degree,Some college/university study without earning ...,Bachelor’s degree,Master’s degree,I prefer not to answer,Bachelor’s degree

In [70]:
import pandas as pd
import json
import numpy as np
test = json.dumps(df1)
d = pd.read_json(test).replace('',np.nan)
for i in d:
    d[i] = d[i].astype(float)
print(d.dtypes)

TypeError: Object of type DataFrame is not JSON serializable

In [69]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, index to Salary
Columns: 3513 entries, 5 to 26164
dtypes: object(3513)
memory usage: 164.7+ KB